In [9]:
import pandas as pd
from statistics import mean
data = pd.read_csv('https://raw.githubusercontent.com/dm-fedorov/pandas_basic/master/data/it.csv')

In [10]:
data['З/п в валюте найма'] = data['З/п в валюте найма'].str.replace(",",".")
data.head(3)

,id,Дата рождения,Вакансия,Технология,Локация,З/п в валюте найма
0,1,18.04.1994,Инженер-программист 2 категории,JS,Санкт-Петербург,140 000.00 ₽
1,2,27.03.1993,Разработчик информационных систем,.NET,Москва,130 000.00 ₽
2,3,24.11.1983,Java Developer,Java,Санкт-Петербург,200 000.00 ₽

In [11]:
dataR = data.loc[data['З/п в валюте найма'].str.contains("₽")]

In [33]:
#я создаю новый столбец, но почему то выскакивает ошибка
dataR['clear val'] = list(map(float, dataR['З/п в валюте найма'].str.replace("\xa0","").str.replace(" ₽","")))
dataR.head(3)

C:\Users\iriska\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,id,Дата рождения,Вакансия,Технология,Локация,З/п в валюте найма,clear val
0,1,18.04.1994,Инженер-программист 2 категории,JS,Санкт-Петербург,140 000.00 ₽,140000.0
1,2,27.03.1993,Разработчик информационных систем,.NET,Москва,130 000.00 ₽,130000.0
2,3,24.11.1983,Java Developer,Java,Санкт-Петербург,200 000.00 ₽,200000.0

In [32]:
#Определите среднюю з.п. по данным в рублях
mean(dataR["clear val"].values)

190669.89488372093

In [45]:
#Определите технологию с максимальной з.п. по данным в рублях
tmp = dataR.groupby(['Технология'])['clear val'].max()
maxVal = tmp[0]
tmp.keys()[0]

'.NET'

In [69]:
#Определите возраст программистов с максимальной з.п. по данным в рублях
import datetime
today = datetime.datetime.strptime('25.5.2020','%d.%m.%Y')
[today - datetime.datetime.strptime(i,'%d.%m.%Y') for i in dataR.loc[dataR["clear val"] == maxVal]['Дата рождения'].values]
#возраст в днях, почему бы и нет?

[datetime.timedelta(days=13332),
 datetime.timedelta(days=17645),
 datetime.timedelta(days=10375),
 datetime.timedelta(days=11403)]

In [72]:
#Определите зарплаты работников, у которых в названии вакансии встречается слово Engineer
data.loc[data['Вакансия'].str.contains("Engineer")]['З/п в валюте найма']

4      172 413.00 ₽
9       9 500.00 zł
11     12 000.00 zł
12     10 500.00 zł
13      9 500.00 zł
18     200 000.00 ₽
19     135 000.00 ₽
37     13 000.00 zł
38      lev6 446.00
39     Ft650 000.00
54     80 000.00 Kč
Name: З/п в валюте найма, dtype: object